import 'package:flutter_quiz/models/quiz_question.dart';

const questions = [
  QuizQuestion(
    'Что может путешествовать по миру, оставаясь в одном и том же углу?',
    [
      'Почтовая марка',
      'Монах Шаолиня',
      'Лось',
      'Лев Алекс',
    ],
  ),
  QuizQuestion(
    'Что бросают тогда, когда это необходимо, и поднимают тогда, когда это уже не нужно?',
    [
      'Якорь',
      'Деньги',
      'Собственное достоинство',
      'Лист акации',
    ],
  ),
  QuizQuestion(
    'На какой вопрос нельзя дать положительный ответ?',
    [
      'Ты спишь?',
      'Когда будет готова задача?',
      'Когда это кончится?',
      'Где деньги, Лебовски?',
    ],
  ),
  QuizQuestion(
    'Чем заканчивается ночь и день?',
    [
      'Мягким знаком',
      'Танцами',
      'Они не заканчиваются',
      'Походом к психологу',
    ],
  ),
  QuizQuestion(
    'Каким будет синий камень, если бросить его в Красное море?',
    [
      'Мокрым',
      'Внезапным',
      'Двойным',
      'Солнечным',
    ],
  ),
  QuizQuestion(
    'У фермера было 12 овец, но все умерли, кроме 7. Сколько осталось?',
    [
      'Семь',
      'Пять',
      'Четыре',
      'Одна',
    ],
  ),
  QuizQuestion(
    'Почему никто не видел слонов, прячущихся на деревьях?',
    [
      'Они действительно хороши в этом',
      'Это не слоны, а зебры',
      'Очень большие деревья',
      'Слишком маленькие слоны',
    ],
  ),
];
